In [2]:
%matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [5]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [8]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [20]:
titles.title.unique().size

212418

### What are the earliest two films listed in the titles dataframe?

In [27]:
sorted_fils = titles.sort_values(by = 'title', ascending = False)

In [37]:
Earliest = sorted_fils.head(2)
Earliest.loc[:, 'title']

64163        zire saghfe doodi
221598    yek taebir asheghane
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [41]:
Hamlet = titles[titles['title'] == 'Hamlet']
Hamlet.title.value_counts()

Hamlet    18
Name: title, dtype: int64

### How many movies are titled "North by Northwest"?

In [42]:
NorthByWest = titles[titles['title'] == 'North by Northwest']

In [43]:
NorthByWest.title.value_counts()

North by Northwest    1
Name: title, dtype: int64

### When was the first movie titled "Hamlet" made?

In [72]:
sf = titles[titles['title'] == 'Hamlet']
sf2 = sf.sort_values(by = 'title', ascending = True)
# 
sf2.head(1)

       title  year
6009  Hamlet  1948

In [64]:
# hamletOrdered.tail(1)

### List all of the "Treasure Island" movies from earliest to most recent.

In [82]:
Tisland = titles[titles['title'] == 'Treasure Island']
Tisland.sort_values(by = 'year', ascending = True)
List_Tisland = Tisland.iloc[:,0:2]
List_Tisland

                  title  year
51287   Treasure Island  1920
89534   Treasure Island  1972
96934   Treasure Island  1950
111343  Treasure Island  1973
179354  Treasure Island  1999
191050  Treasure Island  1934
205397  Treasure Island  1985
206027  Treasure Island  1918

### How many movies were made in the year 1950?

In [83]:
Mvs1950 = titles[titles['year'] == 1950]

In [87]:
Mvs1950.year.value_counts()
# Mvs1950

1950    1099
Name: year, dtype: int64

### How many movies were made in the year 1960?

In [88]:
Mvs1960 = titles[titles['year'] == 1960]

In [89]:
Mvs1960.year.value_counts()

1960    1501
Name: year, dtype: int64

### How many movies were made from 1950 through 1959?

In [115]:
Mvs50_59 = titles[(titles['year'] > 1950) & (titles['year'] <= 1959)]
CtByYear = Mvs50_59.year.value_counts()
# CtByYear.dtypes.itemsize
Unique_T = Mvs50_59.title.unique()

In [118]:
Unique_T.size

11564

### In what years has a movie titled "Batman" been released?

In [120]:
Batman = titles[titles['title'] == 'Batman']
Batman

        title  year
56000  Batman  1989
74608  Batman  1943

In [137]:
Batman.iloc[:, 0:2]

        title  year
56000  Batman  1989
74608  Batman  1943

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?